{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles, notes, daily time limits, and session tracking, with authorization mixed in via AccessControl. It stores per-user data keyed by Principal and exposes query/shared methods for profiles, notes, and time management.",
  "feature_evidence.json": "Machine-readable report mapping product features to frontend files, components, test requirements, and confidence levels. Used to document feature coverage and traceability.",
  "frontend-file-summaries.txt": "Pre-generated JSON-style map summarizing the purpose of each frontend source file. Serves as documentation for architecture and feature ownership.",
  "frontend/index.css": "Global Tailwind CSS base defining design tokens, color variables, and light/dark theme palettes. Applies consistent background, foreground, and border styles across the app.",
  "frontend/index.html": "HTML entry point for the frontend, defining the root mount element and loading the React application module.",
  "frontend/src/App.tsx": "Top-level React component configuring TanStack Router with routes for Dashboard, Games, Notes, and Settings inside a shared AppShell layout.",
  "frontend/src/components/auth/AuthGate.tsx": "Reusable UI component that blocks access to protected features and prompts users to sign in with Internet Identity.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication, loading states, and React Query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog shown to new users to collect and save their display name as a user profile via backend mutation.",
  "frontend/src/components/dashboard/MindfulSuggestionCard.tsx": "Dashboard card that displays a mindful break suggestion when the daily time limit is reached, with a button to cycle suggestions.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application shell with header, navigation tabs, login/profile handling, and global audio controls, and renders routed content via Outlet.",
  "frontend/src/features/games/GamesLanding.tsx": "Renders a grid of game cards (Tic Tac Toe, Sliding Puzzle, Riddles, Math) and notifies the parent when a game is selected.",
  "frontend/src/features/games/math/MathGame.tsx": "Implements a simple math quiz game that generates random arithmetic problems, tracks score, provides feedback, and supports reset.",
  "frontend/src/features/games/puzzle/SlidingPuzzleGame.tsx": "Implements a 3x3 sliding puzzle game with shuffle/reset controls, move counting, and completion detection.",
  "frontend/src/features/games/riddles/RiddlesGame.tsx": "Displays a sequence of riddles with the ability to toggle answers and navigate through a predefined riddle list.",
  "frontend/src/features/games/tictactoe/TicTacToeGame.tsx": "Implements a two-player Tic Tac Toe game with win/draw detection, turn tracking, and reset functionality.",
  "frontend/src/features/notes/DeleteNoteConfirmDialog.tsx": "Provides a confirmation dialog for deleting a note, calling a delete hook and showing success or error toasts.",
  "frontend/src/features/notes/NoteEditor.tsx": "React component for creating and editing notes with title and content fields, using mutation hooks to save changes and showing toast feedback. Handles loading, validation, and a placeholder state when no note is selected.",
  "frontend/src/features/notes/NotesList.tsx": "Displays a scrollable list of notes with previews, dates, selection handling, and delete actions. Shows loading skeletons, empty-state messaging, and a confirmation dialog for deletions.",
  "frontend/src/features/suggestions/suggestions.ts": "Defines a static list of wellbeing suggestions and exports a helper to return a random suggestion, optionally excluding a given one.",
  "frontend/src/hooks/useActor.ts": "Provides a React Query hook to create and cache a backend actor based on the current Internet Identity, including anonymous access and admin token initialization. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useAudioPreferences.ts": "Custom hook that manages ambient audio playback state, volume, and mute preferences with persistence in localStorage. Integrates with an ambient audio utility to play or stop sound based on user settings.",
  "frontend/src/hooks/useDailyTimeLimit.ts": "Hooks to fetch and update a user's daily time limit from the backend using the actor. Uses React Query for caching and invalidation.",
  "frontend/src/hooks/useInAppTimer.ts": "Tracks in-app usage time for the current day, loading prior session records and recording new sessions based on page visibility. Updates elapsed seconds in real time and persists sessions to the backend.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context and provider for Internet Identity, managing login, logout, identity persistence, and login status. Wraps AuthClient creation and exposes a hook for accessing identity state.",
  "frontend/src/hooks/useNotes.ts": "Collection of React Query hooks for fetching, creating, updating, and deleting notes via the backend actor. Automatically invalidates the notes query on successful mutations.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating that queries are organized in feature-specific hooks.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks to load and save the caller's user profile from the backend using React Query. Handles caching, loading state, and invalidation after updates.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and defines a comprehensive set of CSS custom properties for light and dark themes, including colors, radius, charts, and sidebar styling. Applies base background, text, and border styles globally.",
  "frontend/src/lib/audio/ambientAudio.ts": "Provides a utility to create and control ambient background audio using the Web Audio API with a sine oscillator, LFO modulation, and volume control. Exposes play, stop, and setVolume methods.",
  "frontend/src/lib/time.ts": "Contains time-related helpers to format a duration in seconds as HH:MM:SS and to compute the timestamp for the start of the current day.",
  "frontend/src/lib/utils.ts": "Defines a cn helper that merges conditional class names using clsx and resolves Tailwind CSS conflicts via tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that initializes React, sets up React Query and Internet Identity providers, and renders the root App component with global styles.",
  "frontend/src/pages/DashboardPage.tsx": "Implements the dashboard view showing today's elapsed app time, daily limit status, and remaining time, with conditional mindful suggestions when limits are exceeded.",
  "frontend/src/pages/GamesPage.tsx": "Manages a simple in-page game navigator that switches between a landing screen and several mini-games, with a back button to return to the game list.",
  "frontend/src/pages/NotesPage.tsx": "Provides a notes interface gated by authentication, allowing users to view a list of notes, select existing ones, or create and edit new notes.",
  "frontend/src/pages/SettingsPage.tsx": "Renders settings for authenticated users to configure daily time limits and audio preferences, including form validation, persistence, and feedback via toasts.",
  "frontend/src/utils/urlParams.ts": "Offers utilities for reading URL parameters from query strings or hash routing, persisting them in sessionStorage, and safely clearing sensitive parameters without reloading the page.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode via class, content scanning paths, and a centered container layout, and extends the theme with custom fonts, OKLCH-based color tokens, border radii, shadows, and animations. It also enables official plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project metadata and current state for the Mindful Screen app, including schema version, overall summary, and a list of implemented features with requirement IDs and versions. It also tracks new feature requests and acts as a single source of truth for planning and progress."
}