{
  "kind": "build_request",
  "title": "Mindful Screen: mindful session timer, break suggestions, calming audio, mini-games, and notes",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create the Mindful Screen app shell with navigation for: Dashboard (timer + suggestions), Games, Notes, and Settings.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "an screen tracking app name mindful screen ... that app should include games ... the app should include a notes option"
        ]
      },
      "acceptanceCriteria": [
        "App name shown as “Mindful Screen” in the UI header.",
        "User can navigate between Dashboard, Games, Notes, and Settings without page reload issues.",
        "Each section has a clear title and consistent layout."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a mindful screen-time tracker for in-app usage time (time spent actively using the Mindful Screen web app) with a user-configurable daily time limit and session tracking.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "an screen tracking app ... whenever time exceeded the app gives suggestion"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard displays today’s in-app time (hh:mm:ss) and the configured daily limit.",
        "Timer counts only while the app tab is visible (pauses when hidden) and continues when visible again.",
        "User can set and save a daily time limit in Settings; the value persists across reloads.",
        "Backend stores and returns per-user settings and time-tracking state."
      ]
    },
    {
      "id": "REQ-3",
      "text": "When the configured time limit is exceeded, show mindful break suggestions (e.g., “Talk with a friend”, “Read a book”) and provide a way to cycle to a new suggestion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "whenever time exceeded the app gives suggestion like talk with a friend or read a book"
        ]
      },
      "acceptanceCriteria": [
        "When elapsed time >= limit, a prominent “Mindful suggestion” card/banner appears on the Dashboard.",
        "At least 10 suggestions are available, including the examples given by the user.",
        "A “New suggestion” control shows a different suggestion without reloading the page.",
        "The UI clearly indicates the limit has been exceeded."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a Games section that includes at minimum: Tic Tac Toe, a simple puzzle game, a riddles mode, and a math problems mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "that app should include games such as tic tac toe ,puzzles ,riddles ,math problems, etc.,"
        ]
      },
      "acceptanceCriteria": [
        "Games landing page lists the available games and allows launching each one.",
        "Tic Tac Toe: playable Human vs Human with win/draw detection and a reset button.",
        "Puzzle: provide a playable simple puzzle (e.g., sliding tile or jigsaw-style grid) with a reset/shuffle action and completion detection.",
        "Riddles: show a riddle prompt with “Show answer” and “Next riddle”.",
        "Math: generate age-neutral arithmetic questions with input validation, score (correct/total), and “Next question”."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add peaceful, pleasant background music and optional soft sound effects with user controls (play/pause, volume, and mute) and persistence of audio preferences.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the background music and sound should be peaceful and pleasant so that user will not get distraction"
        ]
      },
      "acceptanceCriteria": [
        "Audio controls are accessible (at least from Dashboard and/or a global header).",
        "User can play/pause background music, adjust volume, and mute/unmute.",
        "Audio settings persist across reloads.",
        "Audio defaults are non-intrusive (start muted or require an explicit user action to start playback, to comply with browser autoplay policies)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Implement a Notes feature where the user can create, view, edit, and delete notes to store thoughts or day-to-day activities; notes must persist per user.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the app should include a notes option in which user can store his thoughts or day to day activities"
        ]
      },
      "acceptanceCriteria": [
        "Notes list view shows note title (or first line) and last updated time.",
        "User can create a new note, edit existing notes, and delete notes with a confirmation step.",
        "Notes persist across reloads and are scoped to the signed-in user.",
        "Backend provides CRUD methods for notes and stores them in stable canister state."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Add Internet Identity sign-in and require authentication for saving/retrieving user data (time-limit settings and notes).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "an screen tracking app ... user can store his thoughts"
        ]
      },
      "acceptanceCriteria": [
        "Unauthenticated users can see the app shell but are prompted to sign in to save settings/notes.",
        "After signing in, the app loads the user’s saved settings and notes.",
        "Signing out returns the UI to an unauthenticated state and prevents accessing prior user data."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Apply a coherent, calming visual theme across the app (colors, typography, spacing, and components) optimized for low distraction.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "peaceful and pleasant so that user will not get distraction"
        ]
      },
      "acceptanceCriteria": [
        "Theme is consistent across Dashboard, Games, Notes, and Settings.",
        "Use a calming palette (avoid blue/purple), generous whitespace, and clear typographic hierarchy.",
        "UI components (cards, buttons, inputs) have consistent styling and accessible contrast."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add generated static visual assets for branding and ambiance and render them in the UI (stored in frontend/public/assets/generated).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "mindful screen tracking app name mindful screen"
        ]
      },
      "acceptanceCriteria": [
        "Generated assets are committed under frontend/public/assets/generated.",
        "App uses the logo in the header and the background illustration on key screens (e.g., Dashboard).",
        "Assets load locally without backend image serving."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not modify any files under frontend immutable paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui); compose and use them as-is.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Tracking device-wide or OS-level screen time (outside the web app) is out of scope.",
    "Real-time messaging/chat with friends is out of scope.",
    "Third-party authentication providers other than Internet Identity are out of scope.",
    "External databases or third-party audio streaming services are out of scope."
  ],
  "imageRequirements": {
    "required": [
      "Minimal lotus + phone outline logo, calm earthy palette (mindful-screen-logo.dim_512x512.png)",
      "Soft zen background illustration with warm beige/sage tones, subtle gradients, no characters (mindful-background.dim_1920x1080.png)",
      "Set of 6 small line icons (note, timer, gamepad, music, puzzle, lightbulb) in consistent style (mindful-icons-set.dim_512x512.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}